{
  "appName": "IRA (Islam Réuni et Actif)",
  "lastUpdated": "2023-07-15",
  "version": "1.0",
  "sections": [
    {
      "title": "Introduction",
      "content": "Chez IRA (Islam Réuni et Actif), nous respectons votre vie privée et nous nous engageons à protéger vos données personnelles. Cette politique de confidentialité vous informera sur la façon dont nous traitons vos données personnelles lorsque vous utilisez notre application et vous informera de vos droits en matière de confidentialité et de la manière dont la loi vous protège.\n\nVeuillez lire attentivement cette politique de confidentialité pour comprendre nos politiques et pratiques concernant vos données personnelles. En utilisant notre application, vous acceptez les pratiques décrites dans cette politique."
    },
    {
      "title": "Qui Nous Sommes",
      "content": "IRA (Islam Réuni et Actif) est une application mobile développée et maintenue par RiRi, basée à Masdjid Al-Amoud Ambalamanga Mahajanga, Madagascar. L'application est conçue pour servir la communauté musulmane en fournissant des ressources islamiques, des outils de prière, des forums communautaires et d'autres fonctionnalités connexes.\n\nPour toute question concernant cette politique de confidentialité ou nos pratiques en matière de données, veuillez nous contacter à <a href=\"mailto:support@ira-app.com\" style=\"color:#4ade80;text-decoration:underline;\">support@ira-app.com</a>."
    },
    {
      "title": "Données que Nous Collectons",
      "content": "Nous collectons plusieurs types de données pour fournir et améliorer notre service. Ces données peuvent inclure :\n\n1. **Données Personnelles** : Informations qui peuvent être utilisées pour vous identifier personnellement, telles que votre nom, adresse e-mail, numéro de téléphone, et photo de profil lorsque vous créez un compte.\n\n2. **Données d'Utilisation** : Informations sur la façon dont vous utilisez l'application, y compris les fonctionnalités que vous utilisez le plus, vos préférences de contenu, et vos interactions avec d'autres utilisateurs.\n\n3. **Données de Localisation** : Avec votre permission, nous collectons des données de localisation pour fournir des fonctionnalités précises comme les horaires de prière et la direction de la qibla.\n\n4. **Contenu Utilisateur** : Tout contenu que vous créez, téléchargez ou partagez via l'application, y compris les messages, commentaires, et publications sur les forums.\n\n5. **Données de l'Appareil** : Informations sur votre appareil mobile, y compris le modèle, le système d'exploitation, les identifiants uniques, et les informations réseau."
    },
    {
      "title": "Comment Nous Collectons Vos Données",
      "content": "Nous collectons des données de plusieurs façons :\n\n1. **Informations que vous nous fournissez directement** : Lorsque vous créez un compte, remplissez des formulaires, participez à des forums, ou communiquez avec nous.\n\n2. **Collecte automatique** : Lorsque vous utilisez l'application, nous collectons automatiquement certaines informations à l'aide de technologies comme les cookies et les outils d'analyse.\n\n3. **Sources tierces** : Nous pouvons recevoir des données vous concernant de sources tierces, comme d'autres utilisateurs qui vous invitent à utiliser l'application ou des services d'authentification si vous choisissez de vous connecter via un service tiers."
    },
    {
      "title": "Comment Nous Utilisons Vos Données",
      "content": "Nous utilisons vos données personnelles pour les finalités suivantes :\n\n1. **Fournir et maintenir notre service** : Y compris l'enregistrement de votre compte, l'authentification, et la personnalisation de votre expérience.\n\n2. **Améliorer notre application** : Analyser comment l'application est utilisée pour développer de nouvelles fonctionnalités et améliorer les fonctionnalités existantes.\n\n3. **Communiquer avec vous** : Vous envoyer des notifications, des mises à jour, des alertes de sécurité, et des messages de support.\n\n4. **Fournir des fonctionnalités basées sur la localisation** : Comme les horaires de prière précis et la direction de la qibla.\n\n5. **Faciliter les interactions communautaires** : Permettre les forums de discussion, les messages privés, et autres fonctionnalités sociales.\n\n6. **Assurer la sécurité** : Détecter, prévenir et résoudre les problèmes techniques et de sécurité.\n\n7. **Se conformer aux obligations légales** : Répondre aux demandes légales et respecter nos obligations légales."
    },
    {
      "title": "Publicités et Analyses",
      "content": "Notre application contient des publicités qui constituent une source de revenus essentielle pour maintenir et améliorer nos services. Pour fournir des publicités pertinentes, nous et nos partenaires publicitaires tiers pouvons collecter et utiliser certaines de vos données :\n\n1. **Données collectées pour les publicités** : Identifiants d'appareils, données de localisation générale (comme le pays ou la ville), centres d'intérêt déduits de votre utilisation de l'application, et données démographiques générales.\n\n2. **Comment nous utilisons ces données** : Pour afficher des publicités pertinentes et mesurer l'efficacité des campagnes publicitaires.\n\n3. **Nos partenaires publicitaires** : Nous travaillons avec des réseaux publicitaires tiers qui peuvent également collecter des informations directement via l'application pour personnaliser les annonces.\n\n4. **Vos choix** : Vous pouvez ajuster vos préférences publicitaires dans les paramètres de l'application ou via les paramètres de votre appareil pour limiter le ciblage publicitaire.\n\nNous nous efforçons de sélectionner des partenaires publicitaires qui respectent les valeurs de notre communauté et de filtrer les publicités inappropriées. Cependant, nous ne pouvons pas contrôler entièrement le contenu de chaque publicité fournie par des réseaux tiers."
    },
    {
      "title": "Sally AI et Traitement des Données",
      "content": "Notre application inclut Sally AI, un assistant virtuel alimenté par l'intelligence artificielle utilisant l'API Gemini. Lorsque vous interagissez avec Sally AI :\n\n1. **Données collectées** : Vos questions, commandes et conversations avec l'assistant.\n\n2. **Utilisation des données** : Pour fournir des réponses pertinentes, améliorer les capacités de l'assistant, et personnaliser votre expérience.\n\n3. **Partage avec des tiers** : Vos interactions peuvent être partagées avec Gemini API pour traiter vos demandes. Ces données sont traitées conformément à leurs politiques de confidentialité.\n\n4. **Conservation des données** : Les conversations avec Sally AI peuvent être conservées pour améliorer le service, mais nous nous efforçons de minimiser les données personnelles identifiables dans ces enregistrements."
    },
    {
      "title": "Partage de Vos Données",
      "content": "Nous pouvons partager vos données personnelles dans les situations suivantes :\n\n1. **Avec des fournisseurs de services** : Nous partageons des données avec des fournisseurs de services tiers qui nous aident à exploiter, fournir, améliorer, et développer notre application (comme Supabase, Firebase, et PowerSync).\n\n2. **Pour les paiements et dons** : Lorsque vous effectuez un don ou un paiement, vos informations de paiement sont partagées avec nos processeurs de paiement (Stripe, PayPal, Orange Money).\n\n3. **Avec d'autres utilisateurs** : Lorsque vous publiez du contenu dans les forums ou envoyez des messages à d'autres utilisateurs, ces informations sont partagées avec les destinataires prévus.\n\n4. **Pour des raisons légales** : Si nous sommes légalement tenus de le faire, ou pour protéger nos droits, votre sécurité ou celle d'autres personnes.\n\n5. **Avec votre consentement** : Dans d'autres cas, nous vous demanderons votre consentement avant de partager vos données personnelles."
    },
    {
      "title": "Sécurité des Données",
      "content": "Nous accordons une grande importance à la sécurité de vos données personnelles. Nous avons mis en place des mesures de sécurité appropriées pour empêcher que vos données personnelles ne soient accidentellement perdues, utilisées ou consultées de manière non autorisée, modifiées ou divulguées.\n\nNous limitons l'accès à vos données personnelles aux employés, agents, contractants et autres tiers qui ont un besoin professionnel de les connaître. Ils ne traiteront vos données personnelles que selon nos instructions et sont soumis à une obligation de confidentialité.\n\nNous avons mis en place des procédures pour traiter toute violation présumée de données personnelles et vous informerons, ainsi que toute autorité de régulation applicable, d'une violation lorsque nous sommes légalement tenus de le faire."
    },
    {
      "title": "Conservation des Données",
      "content": "Nous ne conserverons vos données personnelles que le temps nécessaire pour atteindre les finalités pour lesquelles nous les avons collectées, y compris pour satisfaire à toute exigence légale, comptable ou de reporting.\n\nPour déterminer la période de conservation appropriée pour les données personnelles, nous considérons la quantité, la nature et la sensibilité des données personnelles, le risque potentiel de préjudice résultant d'une utilisation ou d'une divulgation non autorisée de vos données personnelles, les finalités pour lesquelles nous traitons vos données personnelles et si nous pouvons atteindre ces finalités par d'autres moyens.\n\nDans certaines circonstances, nous pouvons anonymiser vos données personnelles (afin qu'elles ne puissent plus être associées à vous) à des fins de recherche ou de statistiques, auquel cas nous pouvons utiliser ces informations indéfiniment sans vous en informer davantage."
    },
    {
      "title": "Vos Droits en Matière de Protection des Données",
      "content": "Selon votre juridiction, vous pouvez avoir certains droits concernant vos données personnelles, notamment :\n\n1. **Droit d'accès** : Vous avez le droit de demander des copies de vos données personnelles.\n\n2. **Droit de rectification** : Vous avez le droit de nous demander de corriger les informations que vous pensez être inexactes ou incomplètes.\n\n3. **Droit à l'effacement** : Vous avez le droit de nous demander d'effacer vos données personnelles dans certaines circonstances.\n\n4. **Droit à la limitation du traitement** : Vous avez le droit de nous demander de limiter le traitement de vos données personnelles dans certaines circonstances.\n\n5. **Droit à la portabilité des données** : Vous avez le droit de demander que nous transférions les données que nous avons collectées à une autre organisation ou directement à vous, sous certaines conditions.\n\n6. **Droit d'opposition** : Vous avez le droit de vous opposer à notre traitement de vos données personnelles dans certaines circonstances.\n\nSi vous souhaitez exercer l'un de ces droits, veuillez nous contacter à <a href=\"mailto:support@ira-app.com\" style=\"color:#4ade80;text-decoration:underline;\">support@ira-app.com</a>."
    },
    {
      "title": "Transferts Internationaux de Données",
      "content": "Vos données peuvent être transférées et traitées dans des pays autres que celui dans lequel vous résidez. Ces pays peuvent avoir des lois de protection des données différentes de celles de votre pays.\n\nSpécifiquement, nos serveurs sont situés dans l'Union européenne (AWS eu-central-1) et nous utilisons également des services basés aux États-Unis. Si vous êtes situé en dehors de ces régions, sachez que vos informations peuvent être transférées, stockées et traitées dans ces pays.\n\nEn utilisant notre application, vous consentez à ce transfert, stockage ou traitement. Nous prendrons toutes les mesures raisonnablement nécessaires pour garantir que vos données sont traitées en toute sécurité et conformément à cette politique de confidentialité."
    },
    {
      "title": "Confidentialité des Enfants",
      "content": "Notre application n'est pas destinée aux enfants de moins de 13 ans, et nous ne collectons pas sciemment des données personnelles d'enfants de moins de 13 ans. Si vous êtes un parent ou un tuteur et que vous savez que votre enfant nous a fourni des données personnelles, veuillez nous contacter à <a href=\"mailto:support@ira-app.com\" style=\"color:#4ade80;text-decoration:underline;\">support@ira-app.com</a>."
    },
    {
      "title": "Cookies et Technologies Similaires",
      "content": "Nous utilisons des cookies et des technologies de suivi similaires pour suivre l'activité sur notre application et stocker certaines informations. Les cookies sont des fichiers contenant une petite quantité de données qui peuvent inclure un identifiant unique anonyme.\n\nLes cookies que nous utilisons incluent :\n\n1. **Cookies de session** : Utilisés pour faire fonctionner notre application, ils sont généralement supprimés lorsque vous fermez votre navigateur.\n\n2. **Cookies de préférence** : Utilisés pour reconnaître vos préférences lorsque vous revenez sur notre application.\n\n3. **Cookies de sécurité** : Utilisés pour les fonctionnalités de sécurité et d'authentification.\n\nVous pouvez instruire votre navigateur pour refuser tous les cookies ou pour indiquer quand un cookie est envoyé. Cependant, si vous n'acceptez pas les cookies, vous pourriez ne pas être en mesure d'utiliser certaines parties de notre application."
    },
    {
      "title": "Liens vers d'Autres Sites",
      "content": "Notre application peut contenir des liens vers d'autres sites qui ne sont pas exploités par nous. Si vous cliquez sur un lien tiers, vous serez dirigé vers le site de ce tiers. Nous vous conseillons vivement de consulter la politique de confidentialité de chaque site que vous visitez.\n\nNous n'avons aucun contrôle sur et n'assumons aucune responsabilité pour le contenu, les politiques de confidentialité ou les pratiques de tout site ou service tiers."
    },
    {
      "title": "Modifications de Cette Politique de Confidentialité",
      "content": "Nous pouvons mettre à jour notre politique de confidentialité de temps à autre. Nous vous informerons de tout changement en publiant la nouvelle politique de confidentialité sur cette page et en vous notifiant via l'application ou par email, selon les circonstances.\n\nNous vous conseillons de consulter cette politique de confidentialité périodiquement pour prendre connaissance des modifications. Les modifications apportées à cette politique de confidentialité prennent effet lorsqu'elles sont publiées sur cette page."
    },
    {
      "title": "Navigateur Intégré et Confidentialité",
      "content": "Notre application inclut un navigateur web intégré qui vous permet d'accéder à des sites web sans quitter l'application. Lorsque vous utilisez ce navigateur intégré :\n\n1. **Données collectées** : Nous pouvons collecter des informations sur les sites web que vous visitez pour des raisons de sécurité et pour améliorer la fonctionnalité.\n\n2. **Cookies et données de navigation** : Les sites web que vous visitez peuvent placer leurs propres cookies sur votre appareil et collecter des données conformément à leurs propres politiques de confidentialité.\n\n3. **Contrôle de vos données** : Vous pouvez effacer l'historique de navigation et les cookies du navigateur intégré via les paramètres de l'application.\n\nVeuillez noter que nous ne sommes pas responsables des pratiques de confidentialité des sites web tiers que vous visitez via notre navigateur intégré."
    },
    {
      "title": "Données de Localisation et Confidentialité",
      "content": "Certaines fonctionnalités de notre application, comme les horaires de prière et la direction de la qibla, utilisent des données de localisation. Concernant ces données :\n\n1. **Permission explicite** : Nous ne collectons votre localisation précise qu'avec votre permission explicite.\n\n2. **Utilisation des données** : Ces données sont principalement traitées sur votre appareil pour calculer les horaires de prière précis et la direction de la qibla.\n\n3. **Conservation** : Nous pouvons stocker votre dernière localisation connue pour améliorer les performances de l'application, mais vous pouvez effacer ces données à tout moment via les paramètres.\n\n4. **Désactivation** : Vous pouvez désactiver l'accès à la localisation à tout moment via les paramètres de votre appareil, bien que cela puisse limiter certaines fonctionnalités de l'application."
    },
    {
      "title": "Sécurité des Communications",
      "content": "Notre application inclut des fonctionnalités de messagerie et de forum qui permettent aux utilisateurs de communiquer entre eux. Concernant la sécurité de ces communications :\n\n1. **Chiffrement** : Nous utilisons des protocoles de chiffrement standard de l'industrie pour protéger vos messages en transit.\n\n2. **Stockage des messages** : Les messages et publications sont stockés sur nos serveurs sécurisés pour permettre l'accès sur plusieurs appareils et la récupération des messages.\n\n3. **Modération** : Pour maintenir un environnement sûr et respectueux, nous pouvons examiner le contenu signalé comme inapproprié ou en violation de nos conditions d'utilisation.\n\n4. **Suppression** : Vous pouvez supprimer vos propres messages, mais sachez que les destinataires peuvent avoir déjà vu ou enregistré le contenu."
    },
    {
      "title": "Dons et Informations de Paiement",
      "content": "Notre application vous permet de faire des dons à diverses causes. Concernant vos informations de paiement :\n\n1. **Traitement des paiements** : Les paiements sont traités par des prestataires tiers (Stripe, PayPal, Orange Money) et nous ne stockons pas directement vos informations de carte de crédit complètes.\n\n2. **Données collectées** : Pour faciliter les dons, nous pouvons collecter et stocker votre nom, adresse email, historique des dons et informations de contact.\n\n3. **Utilisation des données** : Ces informations sont utilisées pour traiter les transactions, émettre des reçus, et vous tenir informé de l'impact de vos dons.\n\n4. **Partage des données** : Les informations nécessaires au traitement des paiements sont partagées avec nos processeurs de paiement, qui ont leurs propres politiques de confidentialité."
    },
    {
      "title": "Contact",
      "content": "Si vous avez des questions concernant cette politique de confidentialité, veuillez nous contacter :\n\n- Par email : <a href=\"mailto:support@ira-app.com\" style=\"color:#4ade80;text-decoration:underline;\">support@ira-app.com</a>\n- Par courrier : Masdjid Al-Amoud Ambalamanga Mahajanga, Madagascar\n\nNous nous efforcerons de répondre à toutes les demandes concernant la confidentialité dans les meilleurs délais."
    }
  ]
}
